app/controllers/admin/carts_controller.rb

  def index
    @subbed = Cart.where(status: 'subbed').order(id: :desc)
---
SELECT "carts".* FROM "carts" WHERE "carts"."status" = ? ORDER BY "carts"."id" DESC  [["status", "subbed"]]

  def processing
    @processing = Cart.where(status: 'processing').order(id: :desc)
---
SELECT "carts".* FROM "carts" WHERE "carts"."status" = ? ORDER BY "carts"."id" DESC  [["status", "processing"]]

  def completed
    @completed = Cart.where(status: 'completed').order(id: :desc)
---
SELECT "carts".* FROM "carts" WHERE "carts"."status" = ? ORDER BY "carts"."id" DESC  [["status", "completed"]]

  def declined
    @declined = Cart.where(status: 'declined').order(id: :desc)
---
SELECT "carts".* FROM "carts" WHERE "carts"."status" = ? ORDER BY "carts"."id" DESC  [["status", "declined"]]