app/controllers/products_controller.rb

  def index
    if session[:cart_id] == nil
      @cart = Cart.create
      session[:cart_id] = @cart.id
    else
      @cart = Cart.find(session[:cart_id])
    end

    @products = Product.paginate(page: params[:page], per_page: 10)
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-11-12 15:15:21 UTC], ["updated_at", 2016-11-12 15:15:21 UTC]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def a_cart
    if session[:cart_id] == nil
      @cart = Cart.create
      session[:cart_id] = @cart.id
    else
      @cart = Cart.find(session[:cart_id])
    end

    @product = Product.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def rem1_cart
    @cart = Cart.find(session[:cart_id])

    @cart.remove(Product.find(params[:id]), 1)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def clear_cart
    if session[:cart_id] == nil
      @cart = Cart.create
      session[:cart_id] = @cart.id
    else
      @cart = Cart.find(session[:cart_id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def fill
    @cart = Cart.find(session[:cart_id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def subb
    @cart = Cart.find(session[:cart_id])
    @cart.status = 'subbed'
    @cart.update(cart_params)
    flash[:success] = 'Wait for us to call you.'

    @cart = Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["name", "Pisos Pro"], ["phone", #<BigDecimal:7f959e9f2ff0,'0.775645372E9',9(27)>], ["updated_at", 2016-11-12 16:20:32 UTC], ["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-11-12 16:26:09 UTC], ["updated_at", 2016-11-12 16:26:09 UTC]]