app/views/products/fill.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% @cart.cart_items.each do |item| %>
  <% product = Product.find(item.item_id) %>