app/views/products/index.html.erb

SELECT "categories".* FROM "categories"
---
        <ul>
        <% Category.all.each do |category| %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <% @cart.cart_items.each do |item| %>
            <% product = Product.find(item.item_id) %>